NextFOAM-2409/tutorials/mesh/createPatch/multiRegionHeater_autoPatch/0.orig/topAir/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/topAir";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    maxY
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    minX
    {
        type            uniformFixedValue;
        uniformValue    0.1;
    }
    maxX
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    minZ
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    maxZ
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    group_solid
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    group_fluid
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
